Repository: Zuper4/Hafiz-Quiz
Catalog: lib/l10n/app_*.arb
Languages: ar, es, fr, hi

# appTitle
source: Hafiz Quiz
ar: اختبار الحافظ
es: Cuestionario Hafiz
fr: Quiz Hafiz
hi: हाफ़िज़ क्विज़

# testYourKnowledge
source: Test Your Quran Knowledge
ar: اختبر معرفتك بالقرآن
es: Pon a prueba tu conocimiento del Corán
fr: Testez vos connaissances du Coran
hi: अपने कुरान ज्ञान का परीक्षण करें

# chooseDifficulty
source: Choose a difficulty level to begin
ar: اختر مستوى الصعوبة للبدء
es: Elige un nivel de dificultad para comenzar
fr: Choisissez un niveau de difficulté pour commencer
hi: शुरू करने के लिए कठिनाई स्तर चुनें

source: Easy Mode
ar: الوضع السهل
es: Modo Fácil
fr: Mode Facile
hi: आसान मोड

# easyModeDesc
source: Guess the Surah from its first ayah
ar: خمن السورة من آيتها الأولى
es: Adivina la Sura desde su primer versículo
fr: Devinez la Sourate à partir de son premier verset
hi: पहली आयत से सूरह का अनुमान लगाएं

source: Hard Mode
ar: الوضع الصعب
es: Modo Difícil
fr: Mode Difficile
hi: कठिन मोड

# hardModeDesc
source: Identify Surah from any random ayah
ar: حدد السورة من أي آية عشوائية
es: Identifica la Sura desde cualquier versículo aleatorio
fr: Identifiez la Sourate à partir d'un verset aléatoire
hi: किसी भी यादृच्छिक आयत से सूरह की पहचान करें

source: Practice Mode
ar: وضع التدريب
es: Modo Práctica
fr: Mode Pratique
hi: अभ्यास मोड

# practiceModeDesc
source: Continue until you guess correctly
ar: استمر حتى تخمن بشكل صحيح
es: Continúa hasta que adivines correctamente
fr: Continuez jusqu'à ce que vous deviniez correctement
hi: जब तक सही अनुमान न लगाएं तब तक जारी रखें

source: Settings
ar: الإعدادات
es: Configuración
fr: Paramètres
hi: सेटिंग्स

source: Select Reciter
ar: اختر القارئ
es: Seleccionar recitador
fr: Sélectionner un récitateur
hi: पाठक चुनें

# reciterSettings
source: Reciter
ar: القارئ
es: Recitador
fr: Récitateur
hi: पाठक

# languageSettings
source: Language
ar: اللغة
es: Idioma
fr: Langue
hi: भाषा

# quizSettings
source: Quiz Options
ar: خيارات الاختبار
es: Opciones del cuestionario
fr: Options du quiz
hi: क्विज़ विकल्प

source: Filter by Quality:
ar: تصفية حسب الجودة:
es: Filtrar por calidad:
fr: Filtrer par qualité:
hi: गुणवत्ता के अनुसार फ़िल्टर करें:

# viewMore
source: View More Reciters
ar: عرض المزيد من القراء
es: Ver más recitadores
fr: Voir plus de récitateurs
hi: अधिक पाठकों को देखें

# viewLess
source: Show Less
ar: عرض أقل
es: Ver menos
fr: Voir moins
hi: कम दिखाएं

source: Correct!
ar: صحيح!
es: ¡Correcto!
hi: सही!

source: Incorrect
ar: خاطئ
es: Incorrecto
hi: गलत

# theCorrectAnswer
source: The correct answer is: {surah}
ar: الإجابة الصحيحة هي: {surah}
es: La respuesta correcta es: {surah}
fr: La bonne réponse est: {surah}
hi: सही उत्तर है: {surah}

source: Continue
ar: متابعة
es: Continuar
fr: Continuer
hi: जारी रखें

source: Try Again
ar: حاول مرة أخرى
es: Intentar de nuevo
fr: Réessayer
hi: पुनः प्रयास करें

# listenToAyah
source: Listen to the Ayah
ar: استمع إلى الآية
es: Escucha el versículo
fr: Écoutez le verset
hi: आयत सुनें

# firstAyah
source: First ayah of a Surah
ar: الآية الأولى من السورة
es: Primer versículo de una Sura
fr: Premier verset d'une Sourate
hi: सूरह की पहली आयत

# randomAyah
source: Random ayah from a Surah
ar: آية عشوائية من السورة
es: Versículo aleatorio de una Sura
fr: Verset aléatoire d'une Sourate
hi: सूरह की यादृच्छिक आयत

source: Play Again
ar: أعد التشغيل
es: Reproducir de nuevo
fr: Rejouer
hi: फिर से चलाएं

source: Pause
ar: إيقاف مؤقت
es: Pausa
hi: रोकें

# whichSurah
source: Which Surah is this from?
ar: من أي سورة هذه؟
es: ¿De qué Sura es esto?
fr: De quelle Sourate s'agit-il?
hi: यह किस सूरह से है?

# score
source: Score: {current}/{total}
ar: النتيجة: {current}/{total}
es: Puntuación: {current}/{total}
hi: स्कोर: {current}/{total}

source: End Quiz
ar: إنهاء الاختبار
es: Finalizar cuestionario
fr: Terminer le quiz
hi: क्विज़ समाप्त करें

source: Quiz Results
ar: نتائج الاختبار
es: Resultados del cuestionario
fr: Résultats du quiz
hi: क्विज़ परिणाम

source: Your Score
ar: نتيجتك
es: Tu puntuación
fr: Votre score
hi: आपका स्कोर

# questionsAnswered
source: {count} questions answered
ar: {count} أسئلة تمت الإجابة عليها
es: {count} preguntas respondidas
fr: {count} questions répondues
hi: {count} प्रश्नों के उत्तर दिए गए

source: Excellent!
ar: ممتاز!
es: ¡Excelente!
hi: उत्कृष्ट!

source: Good Job!
ar: عمل جيد!
es: ¡Buen trabajo!
fr: Bon travail!
hi: अच्छा काम!

source: Keep Practicing!
ar: استمر في التدريب!
es: ¡Sigue practicando!
fr: Continuez à pratiquer!
hi: अभ्यास जारी रखें!

source: Try Another Quiz
ar: جرب اختبارًا آخر
es: Probar otro cuestionario
fr: Essayez un autre quiz
hi: दूसरी क्विज़ आज़माएं

source: Back to Home
ar: العودة للصفحة الرئيسية
es: Volver al inicio
fr: Retour à l'accueil
hi: होम पर वापस जाएं

# reciterChanged
source: Reciter changed to {name}
ar: تم تغيير القارئ إلى {name}
es: Recitador cambiado a {name}
fr: Récitateur changé en {name}
hi: पाठक को {name} में बदल दिया गया

# audioLoadFailed
source: Failed to load audio: {error}
ar: فشل تحميل الصوت: {error}
es: Error al cargar el audio: {error}
fr: Échec du chargement audio: {error}
hi: ऑडियो लोड करने में विफल: {error}

source: Input Mode
ar: وضع الإدخال
es: Modo de entrada
fr: Mode de saisie
hi: इनपुट मोड

source: Multiple Choice
ar: اختيار متعدد
es: Opción múltiple
fr: Choix multiples
hi: बहुविकल्पी

source: Text Entry
ar: إدخال نصي
es: Entrada de texto
fr: Saisie de texte
hi: टेक्स्ट एंट्री

# autoNext
source: Auto Next Question
ar: السؤال التالي تلقائيًا
es: Siguiente pregunta automática
fr: Question suivante automatique
hi: स्वचालित अगला प्रश्न

source: Continuous Recitation
ar: التلاوة المستمرة
es: Recitación continua
fr: Récitation continue
hi: निरंतर पाठ

# continuousRecitationDesc
source: Keep playing consecutive ayahs until you guess
ar: استمر في تشغيل الآيات المتتالية حتى تخمن
es: Continúa reproduciendo versículos consecutivos hasta que adivines
fr: Continuez à jouer des versets consécutifs jusqu'à ce que vous deviniez
hi: जब तक आप अनुमान न लगाएं तब तक क्रमागत आयतें चलाते रहें

source: Search Surah...
ar: ابحث عن سورة...
es: Buscar Sura...
fr: Rechercher une Sourate...
hi: सूरह खोजें...

# enterSurahNumber
source: Enter surah number or name
ar: أدخل رقم السورة أو الاسم
es: Ingresa el número o nombre de la Sura
fr: Entrez le numéro ou le nom de la Sourate
hi: सूरह नंबर या नाम दर्ज करें

source: Submit
ar: إرسال
es: Enviar
fr: Soumettre
hi: जमा करें
